zephyrproject-rtos/hal_microchip/mplabx/pic32cxsg/include/pic32cxsg41/component/pac.h
/* -------- PAC_INTFLAGD : (PAC Offset: 0x20) (R/W 32) Peripheral interrupt flag status - Bridge D -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { // __I to avoid read-modify-write on write-to-clear register
  struct {
    __I uint32_t SERCOM4_:1;       /*!< bit:      0  SERCOM4                            */
    __I uint32_t SERCOM5_:1;       /*!< bit:      1  SERCOM5                            */
    __I uint32_t SERCOM6_:1;       /*!< bit:      2  SERCOM6                            */
    __I uint32_t SERCOM7_:1;       /*!< bit:      3  SERCOM7                            */
    __I uint32_t TCC4_:1;          /*!< bit:      4  TCC4                               */
    __I uint32_t TC6_:1;           /*!< bit:      5  TC6                                */
    __I uint32_t TC7_:1;           /*!< bit:      6  TC7                                */
    __I uint32_t ADC0_:1;          /*!< bit:      7  ADC0                               */
    __I uint32_t ADC1_:1;          /*!< bit:      8  ADC1                               */
    __I uint32_t DAC_:1;           /*!< bit:      9  DAC                                */
    __I uint32_t I2S_:1;           /*!< bit:     10  I2S                                */
    __I uint32_t PCC_:1;           /*!< bit:     11  PCC                                */
    __I uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PAC_INTFLAGD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PAC_INTFLAGD_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_INTFLAGD) Peripheral interrupt flag status - Bridge D  Reset Value */

#define PAC_INTFLAGD_SERCOM4_Pos              _UINT32_(0)                                          /* (PAC_INTFLAGD) SERCOM4 Position */
#define PAC_INTFLAGD_SERCOM4_Msk              (_UINT32_(0x1) << PAC_INTFLAGD_SERCOM4_Pos)          /* (PAC_INTFLAGD) SERCOM4 Mask */
#define PAC_INTFLAGD_SERCOM4(value)           (PAC_INTFLAGD_SERCOM4_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_SERCOM5_Pos              _UINT32_(1)                                          /* (PAC_INTFLAGD) SERCOM5 Position */
#define PAC_INTFLAGD_SERCOM5_Msk              (_UINT32_(0x1) << PAC_INTFLAGD_SERCOM5_Pos)          /* (PAC_INTFLAGD) SERCOM5 Mask */
#define PAC_INTFLAGD_SERCOM5(value)           (PAC_INTFLAGD_SERCOM5_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_SERCOM6_Pos              _UINT32_(2)                                          /* (PAC_INTFLAGD) SERCOM6 Position */
#define PAC_INTFLAGD_SERCOM6_Msk              (_UINT32_(0x1) << PAC_INTFLAGD_SERCOM6_Pos)          /* (PAC_INTFLAGD) SERCOM6 Mask */
#define PAC_INTFLAGD_SERCOM6(value)           (PAC_INTFLAGD_SERCOM6_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM6_Pos)) /* Assigment of value for SERCOM6 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_SERCOM7_Pos              _UINT32_(3)                                          /* (PAC_INTFLAGD) SERCOM7 Position */
#define PAC_INTFLAGD_SERCOM7_Msk              (_UINT32_(0x1) << PAC_INTFLAGD_SERCOM7_Pos)          /* (PAC_INTFLAGD) SERCOM7 Mask */
#define PAC_INTFLAGD_SERCOM7(value)           (PAC_INTFLAGD_SERCOM7_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM7_Pos)) /* Assigment of value for SERCOM7 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_TCC4_Pos                 _UINT32_(4)                                          /* (PAC_INTFLAGD) TCC4 Position */
#define PAC_INTFLAGD_TCC4_Msk                 (_UINT32_(0x1) << PAC_INTFLAGD_TCC4_Pos)             /* (PAC_INTFLAGD) TCC4 Mask */
#define PAC_INTFLAGD_TCC4(value)              (PAC_INTFLAGD_TCC4_Msk & (_UINT32_(value) << PAC_INTFLAGD_TCC4_Pos)) /* Assigment of value for TCC4 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_TC6_Pos                  _UINT32_(5)                                          /* (PAC_INTFLAGD) TC6 Position */
#define PAC_INTFLAGD_TC6_Msk                  (_UINT32_(0x1) << PAC_INTFLAGD_TC6_Pos)              /* (PAC_INTFLAGD) TC6 Mask */
#define PAC_INTFLAGD_TC6(value)               (PAC_INTFLAGD_TC6_Msk & (_UINT32_(value) << PAC_INTFLAGD_TC6_Pos)) /* Assigment of value for TC6 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_TC7_Pos                  _UINT32_(6)                                          /* (PAC_INTFLAGD) TC7 Position */
#define PAC_INTFLAGD_TC7_Msk                  (_UINT32_(0x1) << PAC_INTFLAGD_TC7_Pos)              /* (PAC_INTFLAGD) TC7 Mask */
#define PAC_INTFLAGD_TC7(value)               (PAC_INTFLAGD_TC7_Msk & (_UINT32_(value) << PAC_INTFLAGD_TC7_Pos)) /* Assigment of value for TC7 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_ADC0_Pos                 _UINT32_(7)                                          /* (PAC_INTFLAGD) ADC0 Position */
#define PAC_INTFLAGD_ADC0_Msk                 (_UINT32_(0x1) << PAC_INTFLAGD_ADC0_Pos)             /* (PAC_INTFLAGD) ADC0 Mask */
#define PAC_INTFLAGD_ADC0(value)              (PAC_INTFLAGD_ADC0_Msk & (_UINT32_(value) << PAC_INTFLAGD_ADC0_Pos)) /* Assigment of value for ADC0 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_ADC1_Pos                 _UINT32_(8)                                          /* (PAC_INTFLAGD) ADC1 Position */
#define PAC_INTFLAGD_ADC1_Msk                 (_UINT32_(0x1) << PAC_INTFLAGD_ADC1_Pos)             /* (PAC_INTFLAGD) ADC1 Mask */
#define PAC_INTFLAGD_ADC1(value)              (PAC_INTFLAGD_ADC1_Msk & (_UINT32_(value) << PAC_INTFLAGD_ADC1_Pos)) /* Assigment of value for ADC1 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_DAC_Pos                  _UINT32_(9)                                          /* (PAC_INTFLAGD) DAC Position */
#define PAC_INTFLAGD_DAC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGD_DAC_Pos)              /* (PAC_INTFLAGD) DAC Mask */
#define PAC_INTFLAGD_DAC(value)               (PAC_INTFLAGD_DAC_Msk & (_UINT32_(value) << PAC_INTFLAGD_DAC_Pos)) /* Assigment of value for DAC in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_I2S_Pos                  _UINT32_(10)                                         /* (PAC_INTFLAGD) I2S Position */
#define PAC_INTFLAGD_I2S_Msk                  (_UINT32_(0x1) << PAC_INTFLAGD_I2S_Pos)              /* (PAC_INTFLAGD) I2S Mask */
#define PAC_INTFLAGD_I2S(value)               (PAC_INTFLAGD_I2S_Msk & (_UINT32_(value) << PAC_INTFLAGD_I2S_Pos)) /* Assigment of value for I2S in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_PCC_Pos                  _UINT32_(11)                                         /* (PAC_INTFLAGD) PCC Position */
#define PAC_INTFLAGD_PCC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGD_PCC_Pos)              /* (PAC_INTFLAGD) PCC Mask */
#define PAC_INTFLAGD_PCC(value)               (PAC_INTFLAGD_PCC_Msk & (_UINT32_(value) << PAC_INTFLAGD_PCC_Pos)) /* Assigment of value for PCC in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_Msk                      _UINT32_(0x00000FFF)                                 /* (PAC_INTFLAGD) Register Mask  */

#define PAC_INTFLAGD_SERCOM_Pos               _UINT32_(0)                                          /* (PAC_INTFLAGD Position) SERCOM4 */
#define PAC_INTFLAGD_SERCOM_Msk               (_UINT32_(0xF) << PAC_INTFLAGD_SERCOM_Pos)           /* (PAC_INTFLAGD Mask) SERCOM */
#define PAC_INTFLAGD_SERCOM(value)            (PAC_INTFLAGD_SERCOM_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM_Pos)) 
#define PAC_INTFLAGD_TCC_Pos                  _UINT32_(4)                                          /* (PAC_INTFLAGD Position) TCC4 */
#define PAC_INTFLAGD_TCC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGD_TCC_Pos)              /* (PAC_INTFLAGD Mask) TCC */
#define PAC_INTFLAGD_TCC(value)               (PAC_INTFLAGD_TCC_Msk & (_UINT32_(value) << PAC_INTFLAGD_TCC_Pos)) 
#define PAC_INTFLAGD_TC_Pos                   _UINT32_(5)                                          /* (PAC_INTFLAGD Position) TC6 */
#define PAC_INTFLAGD_TC_Msk                   (_UINT32_(0x3) << PAC_INTFLAGD_TC_Pos)               /* (PAC_INTFLAGD Mask) TC */
#define PAC_INTFLAGD_TC(value)                (PAC_INTFLAGD_TC_Msk & (_UINT32_(value) << PAC_INTFLAGD_TC_Pos)) 
#define PAC_INTFLAGD_ADC_Pos                  _UINT32_(7)                                          /* (PAC_INTFLAGD Position) ADCx */
#define PAC_INTFLAGD_ADC_Msk                  (_UINT32_(0x3) << PAC_INTFLAGD_ADC_Pos)              /* (PAC_INTFLAGD Mask) ADC */
#define PAC_INTFLAGD_ADC(value)               (PAC_INTFLAGD_ADC_Msk & (_UINT32_(value) << PAC_INTFLAGD_ADC_Pos)) 

